IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    ++s_camera_sd_status.sdio_full_gpio_restore_success_count;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_RestoreConflictPins(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.conflict_pin_restore_attempt_count;

    /* 只把 PC8、PC9、PC11 恢复为 DCMI AF13，不重启 DCMI 或 DMA。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF13_DCMI;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF13))
    {
        ++s_camera_sd_status.conflict_pin_restore_error_count;
        s_camera_sd_status.conflict_pins_released = 1U;
        s_camera_sd_status.last_conflict_pin_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
        s_camera_sd_status.last_conflict_pin_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
    }

    ++s_camera_sd_status.conflict_pin_restore_success_count;
    s_camera_sd_status.conflict_pins_released = 0U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

void Camera_SDStorage_InitState(void)
{
    s_camera_sd_status.init_attempt_count = 0U;
    s_camera_sd_status.init_success_count = 0U;
    s_camera_sd_status.init_error_count = 0U;
    s_camera_sd_status.last_error_code = CAMERA_SD_OK;
    s_camera_sd_status.is_initialized = 0U;
    s_camera_sd_status.takeover_required = 1U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;
    s_camera_sd_status.last_operation_ms = 0U;
    s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_IDLE;
    s_camera_sd_status.takeover_enter_attempt_count = 0U;
    s_camera_sd_status.takeover_exit_attempt_count = 0U;
    s_camera_sd_status.takeover_enter_success_count = 0U;
    s_camera_sd_status.takeover_exit_success_count = 0U;
    s_camera_sd_status.takeover_error_count = 0U;
    s_camera_sd_status.last_takeover_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_takeover_operation_ms = 0U;
    s_camera_sd_status.takeover_precheck_required = 1U;
    s_camera_sd_status.takeover_precheck_attempt_count = 0U;
    s_camera_sd_status.takeover_precheck_success_count = 0U;
    s_camera_sd_status.takeover_precheck_fail_count = 0U;
    s_camera_sd_status.snapshot_pause_required = 1U;
    s_camera_sd_status.snapshot_pause_confirmed = 0U;
    s_camera_sd_status.conflict_pin_release_ready = 0U;
    s_camera_sd_status.last_takeover_precheck_error_code = CAMERA_SD_OK;
    s_camera_sd_status.conflict_pin_release_attempt_count = 0U;
    s_camera_sd_status.conflict_pin_release_success_count = 0U;
    s_camera_sd_status.conflict_pin_release_error_count = 0U;
    s_camera_sd_status.conflict_pin_restore_attempt_count = 0U;
    s_camera_sd_status.conflict_pin_restore_success_count = 0U;
    s_camera_sd_status.conflict_pin_restore_error_count = 0U;
    s_camera_sd_status.conflict_pins_released = 0U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms = 0U;
    s_camera_sd_status.sdio_af12_switch_attempt_count = 0U;
    s_camera_sd_status.sdio_af12_switch_success_count = 0U;
    s_camera_sd_status.sdio_af12_switch_error_count = 0U;
    s_camera_sd_status.sdio_af12_restore_attempt_count = 0U;
    s_camera_sd_status.sdio_af12_restore_success_count = 0U;
    s_camera_sd_status.sdio_af12_restore_error_count = 0U;
    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms = 0U;
    s_camera_sd_status.sdio_full_gpio_switch_attempt_count = 0U;
    s_camera_sd_status.sdio_full_gpio_switch_success_count = 0U;
    s_camera_sd_status.sdio_full_gpio_switch_error_count = 0U;
    s_camera_sd_status.sdio_full_gpio_restore_attempt_count = 0U;
    s_camera_sd_status.sdio_full_gpio_restore_success_count = 0U;
    s_camera_sd_status.sdio_full_gpio_restore_error_count = 0U;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms = 0U;
    s_camera_sd_status.real_hal_sd_init_enabled = 1U;
    s_camera_sd_status.sdio_clock_enabled = 0U;
    s_camera_sd_status.sdio_hal_init_attempt_count = 0U;
    s_camera_sd_status.sdio_hal_init_success_count = 0U;
    s_camera_sd_status.sdio_hal_init_error_count = 0U;
    s_camera_sd_status.sdio_hal_deinit_attempt_count = 0U;
    s_camera_sd_status.sdio_hal_deinit_success_count = 0U;
    s_camera_sd_status.sdio_hal_deinit_error_count = 0U;
    s_camera_sd_status.last_hal_sd_init_status = (uint32_t)HAL_OK;
    s_camera_sd_status.last_hal_sd_deinit_status = (uint32_t)HAL_OK;
    s_camera_sd_status.last_hal_sd_error = HAL_SD_ERROR_NONE;
    s_camera_sd_status.last_sdio_hal_init_operation_ms = 0U;
    s_camera_sd_status.last_sdio_hal_deinit_operation_ms = 0U;
    s_camera_sd_status.card_info_read_attempt_count = 0U;
    s_camera_sd_status.card_info_read_success_count = 0U;
    s_camera_sd_status.card_info_read_error_count = 0U;
    s_camera_sd_status.last_card_info_status = (uint32_t)HAL_OK;
    s_camera_sd_status.last_card_info_error = HAL_SD_ERROR_NONE;
    s_camera_sd_status.last_card_info_operation_ms = 0U;
    s_camera_sd_status.last_hal_sd_state = 0U;
    s_camera_sd_status.last_hal_sd_card_state = 0U;
    s_camera_sd_status.card_type = 0U;
    s_camera_sd_status.card_version = 0U;
    s_camera_sd_status.card_class = 0U;
    s_camera_sd_status.card_rel_card_add = 0U;
    s_camera_sd_status.card_block_nbr = 0U;
    s_camera_sd_status.card_block_size = 0U;
    s_camera_sd_status.card_log_block_nbr = 0U;
    s_camera_sd_status.card_log_block_size = 0U;
    s_camera_sd_status.block_read_test_enabled = 1U;
    s_camera_sd_status.block_read_attempt_count = 0U;
    s_camera_sd_status.block_read_success_count = 0U;
    s_camera_sd_status.block_read_error_count = 0U;
    s_camera_sd_status.last_block_read_status = (uint32_t)HAL_OK;
    s_camera_sd_status.last_block_read_error = HAL_SD_ERROR_NONE;
    s_camera_sd_status.last_block_read_operation_ms = 0U;
    s_camera_sd_status.last_block_read_addr = 0U;
    s_camera_sd_status.last_block_read_count = 0U;
    s_camera_sd_status.last_block_read_size = 0U;
    s_camera_sd_status.last_block_read_sum = 0U;
    s_camera_sd_status.last_block_read_xor = 0U;
    s_camera_sd_status.last_block_read_nonzero_count = 0U;
    memset(
        s_camera_sd_status.last_block_read_first16,
        0,
        sizeof(s_camera_sd_status.last_block_read_first16));
    s_camera_sd_status.block_read_wait_transfer_attempt_count = 0U;
    s_camera_sd_status.block_read_wait_transfer_success_count = 0U;
    s_camera_sd_status.block_read_wait_transfer_error_count = 0U;
    s_camera_sd_status.last_block_read_pre_card_state = 0U;
    s_camera_sd_status.last_block_read_post_card_state = 0U;
    s_camera_sd_status.last_block_read_wait_card_state = 0U;
    s_camera_sd_status.last_block_read_wait_operation_ms = 0U;
    s_camera_sd_status.last_block_read_wait_timeout_ms = 0U;
    s_camera_sd_status.last_block_read_error_is_data_crc_fail = 0U;
    s_camera_sd_status.last_block_read_error_is_cmd_crc_fail = 0U;
    s_camera_sd_status.last_block_read_error_is_cmd_rsp_timeout = 0U;
    s_camera_sd_status.last_block_read_error_is_data_timeout = 0U;
    s_camera_sd_status.last_block_read_error_is_rx_overrun = 0U;
    s_camera_sd_status.last_block_read_error_is_tx_underrun = 0U;
}

void Camera_SDStorage_GetStatus(CameraSdStorageStatus_t *status)
{
    if (status == NULL)
    {
        return;
    }

