IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    *status = s_camera_sd_status;
}

uint32_t Camera_SDStorage_RequestBlockReadTest(uint32_t block_addr)
{
    return Camera_SDStorage_ReadBlockTest(block_addr);
}

uint32_t Camera_SDStorage_RequestInit(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t hal_start_ms;
    HAL_StatusTypeDef hal_status;

    ++s_camera_sd_status.init_attempt_count;

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 1U)
    {
        /* 完整 SDIO GPIO 未接管时只返回 NEED_TAKEOVER，不调用 HAL_SD_Init。 */
        s_camera_sd_status.last_error_code = CAMERA_SD_ERR_NEED_TAKEOVER;
        s_camera_sd_status.is_initialized = 0U;
        s_camera_sd_status.takeover_required = 1U;
        s_camera_sd_status.sdio_ready = 0U;
        s_camera_sd_status.fatfs_ready = 0U;
        s_camera_sd_status.last_operation_ms = HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_NEED_TAKEOVER;
    }

    Camera_SDStorage_PrepareSdHandle();
    Camera_SDStorage_EnableSdioClock();
    ++s_camera_sd_status.sdio_hal_init_attempt_count;

    hal_start_ms = HAL_GetTick();
    hal_status = HAL_SD_Init(&hsd_snapshot);
    s_camera_sd_status.last_sdio_hal_init_operation_ms =
        HAL_GetTick() - hal_start_ms;
    s_camera_sd_status.last_hal_sd_init_status = (uint32_t)hal_status;
    s_camera_sd_status.last_hal_sd_error = HAL_SD_GetError(&hsd_snapshot);
    s_camera_sd_status.fatfs_ready = 0U;

    if (hal_status == HAL_OK)
    {
        uint32_t card_info_result;

        ++s_camera_sd_status.init_success_count;
        ++s_camera_sd_status.sdio_hal_init_success_count;
        s_camera_sd_status.is_initialized = 1U;
        s_camera_sd_status.sdio_ready = 1U;
        card_info_result = Camera_SDStorage_ReadCardInfo();
        s_camera_sd_status.last_operation_ms = HAL_GetTick() - start_ms;
        return card_info_result;
    }

    ++s_camera_sd_status.init_error_count;
    ++s_camera_sd_status.sdio_hal_init_error_count;
    s_camera_sd_status.is_initialized = 0U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.last_error_code = CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    s_camera_sd_status.last_operation_ms = HAL_GetTick() - start_ms;
    return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
}

uint32_t Camera_SDStorage_RequestTakeoverEnter(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t result;

    ++s_camera_sd_status.takeover_enter_attempt_count;
    ++s_camera_sd_status.takeover_precheck_attempt_count;

    if (Camera_SnapshotControl_IsTakeoverPreconditionReady() == 0U)
    {
        ++s_camera_sd_status.takeover_precheck_fail_count;
        s_camera_sd_status.snapshot_pause_confirmed = 0U;
        s_camera_sd_status.conflict_pin_release_ready = 0U;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        /* 前置条件失败时保持 IDLE，避免误认为接管流程已经开始。 */
        s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_IDLE;
        s_camera_sd_status.last_takeover_error_code =
            CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
        s_camera_sd_status.last_takeover_precheck_error_code =
            CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
        result = CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }
    else
    {
        uint32_t pin_result;

        ++s_camera_sd_status.takeover_precheck_success_count;
        s_camera_sd_status.snapshot_pause_confirmed = 1U;
        s_camera_sd_status.conflict_pin_release_ready = 1U;
        s_camera_sd_status.last_takeover_precheck_error_code = CAMERA_SD_OK;

        pin_result = Camera_SDStorage_ReleaseConflictPins();
        if (pin_result == CAMERA_SD_OK)
        {
            uint32_t af12_result;

            af12_result = Camera_SDStorage_SwitchConflictPinsToSdioAf12();
            if (af12_result == CAMERA_SD_OK)
            {
                uint32_t full_gpio_result;

                full_gpio_result =
                    Camera_SDStorage_SwitchFullSdioGpioToAf12();
                if (full_gpio_result == CAMERA_SD_OK)
                {
                    /* 六个 SDIO GPIO 已切换到 AF12，但不初始化 SDIO 外设。 */
                    s_camera_sd_status.sdio_af12_selected = 1U;
                    s_camera_sd_status.sdio_full_gpio_af12_selected = 1U;
                    s_camera_sd_status.conflict_pins_released = 0U;
                    s_camera_sd_status.takeover_state =
                        CAMERA_SD_TAKEOVER_STATE_ENTER_DEFERRED;
                    s_camera_sd_status.last_conflict_pin_error_code =
                        CAMERA_SD_OK;
                    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
                    s_camera_sd_status.last_sdio_full_gpio_error_code =
                        CAMERA_SD_OK;
                    s_camera_sd_status.last_takeover_precheck_error_code =
                        CAMERA_SD_OK;
                    s_camera_sd_status.last_takeover_error_code =
                        CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
                    result = CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
                }
                else
                {
                    ++s_camera_sd_status.takeover_error_count;
                    s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
                    s_camera_sd_status.takeover_state =
                        CAMERA_SD_TAKEOVER_STATE_ERROR;
                    s_camera_sd_status.last_takeover_error_code =
                        CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
                    result = CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
                }
            }
            else
            {
                ++s_camera_sd_status.takeover_error_count;
                s_camera_sd_status.sdio_af12_selected = 0U;
                s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
                s_camera_sd_status.takeover_state =
                    CAMERA_SD_TAKEOVER_STATE_ERROR;
                s_camera_sd_status.last_takeover_error_code =
                    CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
                result = CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
            }
        }
        else
        {
            ++s_camera_sd_status.takeover_error_count;
            s_camera_sd_status.conflict_pin_release_ready = 0U;
            s_camera_sd_status.sdio_af12_selected = 0U;
            s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
            s_camera_sd_status.takeover_state =
                CAMERA_SD_TAKEOVER_STATE_ERROR;
            s_camera_sd_status.last_takeover_error_code =
                CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
            result = CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
        }
    }

    s_camera_sd_status.last_takeover_operation_ms = HAL_GetTick() - start_ms;

    return result;
}

uint32_t Camera_SDStorage_RequestTakeoverExit(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t pin_result;
    uint32_t result;

    ++s_camera_sd_status.takeover_exit_attempt_count;
    s_camera_sd_status.conflict_pin_release_ready = 0U;

    if ((s_camera_sd_status.is_initialized != 0U) ||
        (s_camera_sd_status.sdio_clock_enabled != 0U))
    {
        uint32_t hal_start_ms = HAL_GetTick();
        HAL_StatusTypeDef hal_status;

        ++s_camera_sd_status.sdio_hal_deinit_attempt_count;
        hal_status = HAL_SD_DeInit(&hsd_snapshot);
        s_camera_sd_status.last_sdio_hal_deinit_operation_ms =
            HAL_GetTick() - hal_start_ms;
        s_camera_sd_status.last_hal_sd_deinit_status = (uint32_t)hal_status;
        s_camera_sd_status.last_hal_sd_error = HAL_SD_GetError(&hsd_snapshot);

        if (hal_status == HAL_OK)
        {
            ++s_camera_sd_status.sdio_hal_deinit_success_count;
        }
        else
        {
            ++s_camera_sd_status.sdio_hal_deinit_error_count;
            s_camera_sd_status.last_error_code =
                CAMERA_SD_ERR_SDIO_HAL_DEINIT_FAILED;
        }

        /* 即使 HAL_SD_DeInit 失败，也必须关时钟并继续恢复 GPIO。 */
        Camera_SDStorage_DisableSdioClock();
    }

    s_camera_sd_status.is_initialized = 0U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 0U)
    {
        uint32_t full_gpio_result =
            Camera_SDStorage_LeaveFullSdioGpioToInput();

        if (full_gpio_result != CAMERA_SD_OK)
        {
            ++s_camera_sd_status.takeover_error_count;
            s_camera_sd_status.sdio_af12_selected = 0U;
            s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_ERROR;
            s_camera_sd_status.last_takeover_error_code =
                CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
            s_camera_sd_status.last_takeover_operation_ms =
                HAL_GetTick() - start_ms;
            return CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
        }
    }
    else if (s_camera_sd_status.sdio_af12_selected != 0U)
    {
        uint32_t af12_result = Camera_SDStorage_LeaveSdioAf12ToInput();

        if (af12_result != CAMERA_SD_OK)
        {
            ++s_camera_sd_status.takeover_error_count;
            s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_ERROR;
            s_camera_sd_status.last_takeover_error_code =
                CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
            s_camera_sd_status.last_takeover_operation_ms =
                HAL_GetTick() - start_ms;
            return CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
        }
    }

    pin_result = Camera_SDStorage_RestoreConflictPins();

    if (pin_result == CAMERA_SD_OK)
    {
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        s_camera_sd_status.snapshot_pause_confirmed = 0U;
        s_camera_sd_status.takeover_state =
            CAMERA_SD_TAKEOVER_STATE_EXIT_DEFERRED;
        s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
        s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
        s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
        s_camera_sd_status.last_takeover_error_code =
            CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
        result = CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
    }
    else
    {
        ++s_camera_sd_status.takeover_error_count;
        s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_ERROR;
        s_camera_sd_status.last_takeover_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
        result = CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
    }

    s_camera_sd_status.last_takeover_operation_ms = HAL_GetTick() - start_ms;

    return result;
}

const char *Camera_SDStorage_ErrorToString(uint32_t error_code)
{
    switch (error_code)
    {
        case CAMERA_SD_OK:
            return "OK";

        case CAMERA_SD_ERR_NOT_IMPLEMENTED:
            return "NOT_IMPLEMENTED";

        case CAMERA_SD_ERR_PIN_CONFLICT:
            return "PIN_CONFLICT";

